In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [18]:
df_new = df[['OdName','AreaName',1980]]
df_new = df_new.head()
df_OdName = df_new.set_index('OdName')

# Insert a new Row

In [4]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [6]:
df_new.loc[5] = ["India", "Asia", 10]  #New Row Inserted

In [7]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0
5           India     Asia    10

In [19]:
df_OdName

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0

In [21]:
df_OdName.loc["India"] = ["Asia", 10]

In [22]:
df_OdName

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
India              Asia    10

# No Modification if same Row already exist

In [10]:
df_new.loc[5] = ["India", "Asia", 10] #No Modification if same Row already exist

In [11]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0
5           India     Asia    10

# Insertion is not Needed to be in Sequence

In [12]:
df_new.loc[7] = ["Bangladesh", "Asia", 11] # 6th Index is missing, Inserted into 7th

In [13]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0
5           India     Asia    10
7      Bangladesh     Asia    11

In [14]:
df_new.index.values.tolist()

[0, 1, 2, 3, 4, 5, 7]

In [15]:
df_new.loc[6] = ["Nepal", "Asia", 12]

In [16]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0
5           India     Asia    10
7      Bangladesh     Asia    11
6           Nepal     Asia    12

# All Column Values Must need to be provided. Otherwise ERROR

In [17]:
df_new.loc[8] = ["Bhutan"]  #Provided Only one COlumn Value

ValueError: cannot set a row with mismatched columns